In [1]:
import numpy as np
import pandas as pd

### json_normalize 1 column to multiple columns
### json_normalize does not increase number of rows, number of columns are increased
### explode does increases number of rows, not columns

In [2]:
d0= {
    'Name':'ABD',
    'Roll':123
}

## Dictionary

# You can flatten to a single row using json_normalize

pd.json_normalize(d0)

  Name  Roll
0  ABD   123

In [3]:
d1= [ {
    'Name':'ABD',
    'Roll':123
} ,  
{
    'Name':'BCD',
    'Roll':435
}
]


pd.json_normalize(d1)

  Name  Roll
0  ABD   123
1  BCD   435

In [4]:
## NESTED

d3= [ {
    'Name':'ABD',
    'Roll':123,
    'Nested':{
        'course':'Finance',
        'year':'2022'
    }
} ,  
{
    'Name':'BCD',
    'Roll':435,
    'Nested':{
        'course':'Math',
 
    }
}
]

pd.json_normalize(d3)
## Missing elements

  Name  Roll Nested.course Nested.year
0  ABD   123       Finance        2022
1  BCD   435          Math         NaN

### EXPLODE -  1 column to multiple rows
## Reset Index if you don't wont same row number

In [5]:
arr= [[ 
     'Aravind',
    'Deva'
], [ 
     'Brahma',
    'Deva'
]]
df=pd.DataFrame()
df['Name']=arr
# df.explode(arr)

In [6]:
df

              Name
0  [Aravind, Deva]
1   [Brahma, Deva]

In [7]:
df.explode('Name')

      Name
0  Aravind
0     Deva
1   Brahma
1     Deva

In [8]:
df.explode('Name').reset_index(drop=True)

      Name
0  Aravind
1     Deva
2   Brahma
3     Deva

In [9]:
df

              Name
0  [Aravind, Deva]
1   [Brahma, Deva]

In [10]:
df['json']= [d0,d0]

In [11]:
df

              Name                          json
0  [Aravind, Deva]  {'Name': 'ABD', 'Roll': 123}
1   [Brahma, Deva]  {'Name': 'ABD', 'Roll': 123}

In [12]:
pd.json_normalize(df['json'])

  Name  Roll
0  ABD   123
1  ABD   123

In [13]:
df['json']= [d1,d1] 
df

              Name                                               json
0  [Aravind, Deva]  [{'Name': 'ABD', 'Roll': 123}, {'Name': 'BCD',...
1   [Brahma, Deva]  [{'Name': 'ABD', 'Roll': 123}, {'Name': 'BCD',...

In [14]:
pd.json_normalize(df['json'])

                              0                             1
0  {'Name': 'ABD', 'Roll': 123}  {'Name': 'BCD', 'Roll': 435}
1  {'Name': 'ABD', 'Roll': 123}  {'Name': 'BCD', 'Roll': 435}

In [15]:
df['json']= [d3,d3] 
df

              Name                                               json
0  [Aravind, Deva]  [{'Name': 'ABD', 'Roll': 123, 'Nested': {'cour...
1   [Brahma, Deva]  [{'Name': 'ABD', 'Roll': 123, 'Nested': {'cour...

In [16]:
pd.json_normalize(df['json'])

,0,1
0,"{'Name': 'ABD', 'Roll': 123, 'Nested.course': ...","{'Name': 'BCD', 'Roll': 435, 'Nested.course': ..."
1,"{'Name': 'ABD', 'Roll': 123, 'Nested.course': ...","{'Name': 'BCD', 'Roll': 435, 'Nested.course': ..."